#include<stdio.h>
#include<locale.h>
#define ROWS 8
#define COLS 8

void pole();
char a[9][9] = {
{' ', '2', '4', '2', '2', '0', '6', '6', '6'},
{'3', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '},
{'3', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '},
{'6', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '},
{'3', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '},
{'3', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '},
{'5', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '},
{'5', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '},
{'0', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '},

};


void main()
{
	int a;
	int massiv = pole;
	setlocale(LC_CTYPE, "Rus");

	do
	{
		printf("\nИгра Облака\n");
		printf("Меню:\n");
		printf("Выберите опцию\n 1) Начать игру\n 2) Правила игры\n 3) Выход\n");
		scanf("%d", &a);
		getchar();

		switch (a)
		{
		case 1:
			pole();
			break;
		case 2:
			printf("Задача – расставить “облака” (прямоугольники) в “небе” (сетке головоломки) так, чтобы они не касались друг друга ни сторонами, ни углами.\n");
			printf("Числа по краям сетки означают количество клеток, занятых “облаками”. Минимальный размер “облака” – 2 на 2 клетки\n");
			break;
		case 3:
			return 0;
			break;
		default:
			printf("Неизвестная опция\n");
			break;
		}

	} while (a != 3);

}

void pole()
{
	int n = 8;
	printf("___________________________\n");
	for (int i = 0; i <= n; i++)
	{
		for (int j = 0; j <= n; j++)
		{
			printf("|_%c", a[i][j]);
		}
		printf("|\n");
	}
}